In [1]:
print(7**9)

40353607

In [3]:
x=3033
y=333
print(x==y)
print(x<y)
print(x>y)
print(x!=y)
print(x+y)

False
True
False
True
63

In [5]:
list=[39,33,49,20,12]
print('49' not in list)

True

In [15]:
def surname(add):
    print(add +" tripathi")
surname("Rishi Raj")
surname("Shubham")
surname("Riya")
surname("krishna")

Rishi Raj tripathi
Shubham tripathi
Riya tripathi
krishna tripathi

In [2]:
thistuple=("appe","maongo","icecream")
print(thistuple)

('appe', 'maongo', 'icecream')

In [4]:
thistuple=("rishi","raj","singh","bhati")
print(thistuple[2])

singh

In [7]:
hello=("rishi","raj","singh","bhati")
print(hello[0:3])

('rishi', 'raj', 'singh')

In [11]:
def addition(add):
    print(add *"*")
addition(2)
addition(3)
addition(4)
addition(5)
addition(6)

**
***
****
*****
******

In [10]:
import pandas as pd
data = {
    "Name": ["Rishi raj", "riya","Shyam"],
    "marks": [1, 2, 3]
}
myvar = pd.DataFrame(data)
myvar

        Name  marks
0  Rishi raj      1
1       riya      2
2      Shyam      3

In [9]:
import pandas as pd

df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])
data = pd.DataFrame(df)
data

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [15]:
import pandas as pd
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [16]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [17]:
data.pop

<bound method DataFrame.pop of               area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135>